CS/Python/python.org
* Python basic operations:

- 当你运行一个Python模块 python fibo.py <arguments>

- 模块中的代码将会被执行，就像导入它一样，不过此时name 被设置为 “main“。这意味着，通过在你的模块末尾添加此代码.
- can’t import module from upper directory.

    - need to add the working directory to .bashrc PYTHONPATH
    - using ipython.
import os

    - print os.path.abspath(ylib.__file__)

- make a python 3 virtual environment:
mkvirtual -p python3 ENVNAME
- get specific timezone datetime
#+begin_src python
tz = pytz.timezone('America/Los_Angeles')
#date = date.today()
now = datetime.now()
los_angeles_time = datetime.now(tz)
#+end_src

- use tqdm as a status bar:
#+begin_src python
from tqdm import tqdm
from time import sleep
for i in tqdm(range(10)):
    sleep(0.1)
#+end_src

- find difference of two lists:
#+begin_src python
a = [1,2,3,2,1,5,6,5,5,5]
import collections
print [item for item, count in collections.Counter(a).items() if count > 1]
#+end_src

- 列表生成式
#+begin_src python
[a.lower() for a in x=['Hello', 'World', 18, 'Apple', None] if isinstance(a,str)]
#+end_src

- function parameter
pass the parameters boo(a=1,b=2) won’t change the value of the parameters themselves.
the sequence of the parameters are certain, you can’t change it.
函数中改变形参值不会改变原值。
- a, b = b, a + b # 相当于：
#+begin_src python
t = (b, a + b) # t是一个tuple
a = t[0]
b = t[1]
#+end_src

- The ^ symbol is for the bitwise ‘xor’ operation:
but in Python, the exponent operator symbol is **.

- 生成器
通过列表生成式，我们可以直接创建一个列表。但是，受到内存限制，列表容量肯定是有限的。而且，创建一个包含100万个元素的列表，不仅占用很大的存储空间，如果我们仅仅需要访问前面几个元素，那后面绝大多数元素占用的空间都白白浪费了。
要创建一个generator，有很多种方法。第一种方法很简单，只要把一个列表生成式的[]改成()，就创建了一个generator：
如果要一个一个打印出来，可以通过next()函数获得generator的下一个返回值：
next(g)
这里，最难理解的就是generator和函数的执行流程不一样。函数是顺序执行，遇到return语句或者最后一行函数语句就返回。而变成generator的函数，在每次调用next()的时候执行，遇到yield语句返回，再次执行时从上次返回的yield语句处继续执行。

#+begin_src python
def odd():
    print('step 1')

    yield 1
    print('step 2')
    yield(3)
    print('step 3')
    yield(5)
>>> o = odd()
>>> next(o)
step 1
1
>>> next(o)
step 2
3
>>> next(o)
step 3
5
>>> next(o)
Traceback (most recent call last):

  File "<stdin>", line 1, in <module>
StopIteration
#+end_src


- read file to a list:
#+begin_src python
with open(r'y:\codes\data\smart_beta_etf_list.txt', 'rb') as f:
#+end_src


-   etf_list = f.readlines()
# you may also want to remove whitespace characters like `\n` at the end of each line
etf_list = [x.strip() for x in etf_list]

- save a list to a file:
thefile = open('test.txt', 'w')

- for item in thelist:
thefile.write("%s\n" % item)

- replace comma as next line (enter):
choose extend mode: replace ',' as \r\n

- string to datetime:
time.strptime(string[, format])
- iterate key and value in a dictionary:
for k, v in dict.iteritems():
- iterate keys in a dictionary:
for k in dict:
- iterate a row in pandas dataframe:
#+begin_src python
DataFrame.iterrows():
return generator.
>>> df = pd.DataFrame([[1, 1.5]], columns=['int', 'float'])
>>> row = next(df.iterrows())[1]
>>> row
int      1.0
float    1.5
Name: 0, dtype: float64
>>> print(row['int'].dtype)
float64
>>> print(df['int'].dtype)
int64
#+end_src

To preserve dtypes while iterating over the rows, it is better to use itertuples() which returns tuples of the values and which is generally faster as iterrows.

- install setup.py:
python setup.py install
- magic method:
getitem in a class allows its instances to use the [ ] (indexer) operators
- setitem Called to implement assignment to self[key]

- call magic method in a class causes its instances to become callables – in other words, those instances now behave like functions.
- getattr overrides Python’s default mechanism for member access.
- getattr magic method only gets invoked for attributes that are not in the dict magic attribute. Implementing getattr causes the hasattr built-in function to always return True, unless an exception is raised from within getattr.
- setattr allows you to override Python’s default mechanism for member assignment.
- split strings by space delimiter from reverse:

#+begin_src python
text.rsplit(' ', 1)[0]
#+end_src

- split strings by space delimiter from beginning:
#+begin_src python
text.split(' ', 1)[0]
>>>a.split('.',1)
['alvy','test.txt']
后面多了一个参数1，以第一个'.'分界，分成两个字符串，组成一个list
>>>a.rsplit('.',1)
['alvy.test','txt']
现在是rsplit函数，从右边第一个'.'分界，分成两个字符串，组成一个list
#+end_src

- unittest:
check data operation:
create, select, update, delete.

    - checking parameter types, classes, or values.
    - checking data structure invariants.
    - checking “can’t happen” situations (duplicates in a list, contradictory state variables.)
    - after calling a function, to make sure that its return is reasonable.

