docs/CS/Python/python.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-04-22 Sat 15:12 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="weiwu" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Python basic operations:</a></li>
<li><a href="#orgheadline4">2. Data Analysis:</a>
<ul>
<li><a href="#orgheadline2">2.1. pandas:</a></li>
<li><a href="#orgheadline3">2.2. plot:</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Python basic operations:</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>当你运行一个Python模块 python fibo.py &lt;arguments&gt;</li>

<li>模块中的代码将会被执行，就像导入它一样，不过此时name 被设置为 “main“。这意味着，通过在你的模块末尾添加此代码.</li>
<li>can’t import module from upper directory.

<ul class="org-ul">
<li>need to add the working directory to .bashrc PYTHONPATH</li>
<li>using ipython.</li>
</ul></li>
</ul>
<p>
import os
</p>

<ul class="org-ul">
<li>print os.path.abspath(ylib._<sub>file</sub>__)</li>
</ul>
<ul class="org-ul">
<li>make a python 3 virtual environment:</li>
</ul>
<p>
mkvirtual -p python3 ENVNAME
</p>
<ul class="org-ul">
<li>get specific timezone datetime</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #FD971F;">tz</span> = pytz.timezone<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'America/Los_Angeles'</span><span style="color: #AE81FF;">)</span>
<span style="color: #75715E;">#</span><span style="color: #75715E;">date = date.today()</span>
<span style="color: #FD971F;">now</span> = datetime.now<span style="color: #AE81FF;">()</span>
<span style="color: #FD971F;">los_angeles_time</span> = datetime.now<span style="color: #AE81FF;">(</span>tz<span style="color: #AE81FF;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>use tqdm as a status bar:</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #F92672;">from</span> tqdm <span style="color: #F92672;">import</span> tqdm
<span style="color: #F92672;">from</span> time <span style="color: #F92672;">import</span> sleep
<span style="color: #F92672;">for</span> i <span style="color: #F92672;">in</span> tqdm<span style="color: #AE81FF;">(</span><span style="color: #F92672;">range</span><span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">10</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>:
    sleep<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>find difference of two lists:</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #FD971F;">a</span> = <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">1</span>,<span style="color: #AE81FF;">2</span>,<span style="color: #AE81FF;">3</span>,<span style="color: #AE81FF;">2</span>,<span style="color: #AE81FF;">1</span>,<span style="color: #AE81FF;">5</span>,<span style="color: #AE81FF;">6</span>,<span style="color: #AE81FF;">5</span>,<span style="color: #AE81FF;">5</span>,<span style="color: #AE81FF;">5</span><span style="color: #AE81FF;">]</span>
<span style="color: #F92672;">import</span> collections
<span style="color: #F92672;">print</span> <span style="color: #AE81FF;">[</span>item <span style="color: #F92672;">for</span> item, count <span style="color: #F92672;">in</span> collections.Counter<span style="color: #66D9EF;">(</span>a<span style="color: #66D9EF;">)</span>.items<span style="color: #66D9EF;">()</span> <span style="color: #F92672;">if</span> count &gt; <span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">]</span>
</pre>
</div>

<ul class="org-ul">
<li>列表生成式</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #AE81FF;">[</span>a.lower<span style="color: #66D9EF;">()</span> <span style="color: #F92672;">for</span> a <span style="color: #F92672;">in</span> x=<span style="color: #66D9EF;">[</span><span style="color: #E6DB74;">'Hello'</span>, <span style="color: #E6DB74;">'World'</span>, <span style="color: #AE81FF;">18</span>, <span style="color: #E6DB74;">'Apple'</span>, <span style="color: #AE81FF;">None</span><span style="color: #66D9EF;">]</span> <span style="color: #F92672;">if</span> <span style="color: #F92672;">isinstance</span><span style="color: #66D9EF;">(</span>a,<span style="color: #F92672;">str</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">]</span>
</pre>
</div>

<ul class="org-ul">
<li>function parameter</li>
</ul>
<p>
pass the parameters boo(a=1,b=2) won’t change the value of the parameters themselves.
the sequence of the parameters are certain, you can’t change it.
函数中改变形参值不会改变原值。
</p>
<ul class="org-ul">
<li>a, b = b, a + b # 相当于：</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #FD971F;">t</span> = <span style="color: #AE81FF;">(</span>b, a + b<span style="color: #AE81FF;">)</span> <span style="color: #75715E;"># </span><span style="color: #75715E;">t&#26159;&#19968;&#20010;tuple</span>
<span style="color: #FD971F;">a</span> = t<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">0</span><span style="color: #AE81FF;">]</span>
<span style="color: #FD971F;">b</span> = t<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">]</span>
</pre>
</div>

<ul class="org-ul">
<li>The ^ symbol is for the bitwise ‘xor’ operation:</li>
</ul>
<p>
but in Python, the exponent operator symbol is **.
</p>

<ul class="org-ul">
<li>生成器</li>
</ul>
<p>
通过列表生成式，我们可以直接创建一个列表。但是，受到内存限制，列表容量肯定是有限的。而且，创建一个包含100万个元素的列表，不仅占用很大的存储空间，如果我们仅仅需要访问前面几个元素，那后面绝大多数元素占用的空间都白白浪费了。
要创建一个generator，有很多种方法。第一种方法很简单，只要把一个列表生成式的[]改成()，就创建了一个generator：
如果要一个一个打印出来，可以通过next()函数获得generator的下一个返回值：
next(g)
这里，最难理解的就是generator和函数的执行流程不一样。函数是顺序执行，遇到return语句或者最后一行函数语句就返回。而变成generator的函数，在每次调用next()的时候执行，遇到yield语句返回，再次执行时从上次返回的yield语句处继续执行。
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #F92672;">def</span> <span style="color: #A6E22E;">odd</span><span style="color: #AE81FF;">()</span>:
    <span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'step 1'</span><span style="color: #AE81FF;">)</span>

    <span style="color: #F92672;">yield</span> <span style="color: #AE81FF;">1</span>
    <span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'step 2'</span><span style="color: #AE81FF;">)</span>
    <span style="color: #F92672;">yield</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span>
    <span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'step 3'</span><span style="color: #AE81FF;">)</span>
    <span style="color: #F92672;">yield</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">5</span><span style="color: #AE81FF;">)</span>
&gt;&gt;&gt; <span style="color: #FD971F;">o</span> = odd<span style="color: #AE81FF;">()</span>
&gt;&gt;&gt; <span style="color: #F92672;">next</span><span style="color: #AE81FF;">(</span>o<span style="color: #AE81FF;">)</span>
step <span style="color: #AE81FF;">1</span>
<span style="color: #AE81FF;">1</span>
&gt;&gt;&gt; <span style="color: #F92672;">next</span><span style="color: #AE81FF;">(</span>o<span style="color: #AE81FF;">)</span>
step <span style="color: #AE81FF;">2</span>
<span style="color: #AE81FF;">3</span>
&gt;&gt;&gt; <span style="color: #F92672;">next</span><span style="color: #AE81FF;">(</span>o<span style="color: #AE81FF;">)</span>
step <span style="color: #AE81FF;">3</span>
<span style="color: #AE81FF;">5</span>
&gt;&gt;&gt; <span style="color: #F92672;">next</span><span style="color: #AE81FF;">(</span>o<span style="color: #AE81FF;">)</span>
Traceback <span style="color: #AE81FF;">(</span>most recent call last<span style="color: #AE81FF;">)</span>:

  File <span style="color: #E6DB74;">"&lt;stdin&gt;"</span>, line <span style="color: #AE81FF;">1</span>, <span style="color: #F92672;">in</span> &lt;module&gt;
<span style="color: #66D9EF;">StopIteration</span>
</pre>
</div>


<ul class="org-ul">
<li>read file to a list:</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #F92672;">with</span> <span style="color: #F92672;">open</span><span style="color: #AE81FF;">(</span>r<span style="color: #E6DB74;">'y:\codes\data\smart_beta_etf_list.txt'</span>, <span style="color: #E6DB74;">'rb'</span><span style="color: #AE81FF;">)</span> <span style="color: #F92672;">as</span> f:
</pre>
</div>


<ul class="org-ul">
<li>etf<sub>list</sub> = f.readlines()</li>
</ul>

<p>
etf<sub>list</sub> = [x.strip() for x in etf<sub>list</sub>]
</p>

<ul class="org-ul">
<li>save a list to a file:</li>
</ul>
<p>
thefile = open('test.txt', 'w')
</p>

<ul class="org-ul">
<li>for item in thelist:</li>
</ul>
<p>
thefile.write("%s\n" % item)
</p>

<ul class="org-ul">
<li>replace comma as next line (enter):</li>
</ul>
<p>
choose extend mode: replace ',' as \r\n
</p>

<ul class="org-ul">
<li>string to datetime:</li>
</ul>
<p>
time.strptime(string[, format])
</p>
<ul class="org-ul">
<li>iterate key and value in a dictionary:</li>
</ul>
<p>
for k, v in dict.iteritems():
</p>
<ul class="org-ul">
<li>iterate keys in a dictionary:</li>
</ul>
<p>
for k in dict:
</p>
<ul class="org-ul">
<li>iterate a row in pandas dataframe:</li>
</ul>
<div class="org-src-container">

<pre class="src src-python">DataFrame.iterrows<span style="color: #AE81FF;">()</span>:
<span style="color: #F92672;">return</span> generator.
&gt;&gt;&gt; <span style="color: #FD971F;">df</span> = pd.DataFrame<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">[</span><span style="color: #A6E22E;">[</span><span style="color: #AE81FF;">1</span>, <span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">5</span><span style="color: #A6E22E;">]</span><span style="color: #66D9EF;">]</span>, columns=<span style="color: #66D9EF;">[</span><span style="color: #E6DB74;">'int'</span>, <span style="color: #E6DB74;">'float'</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>
&gt;&gt;&gt; <span style="color: #FD971F;">row</span> = <span style="color: #F92672;">next</span><span style="color: #AE81FF;">(</span>df.iterrows<span style="color: #66D9EF;">()</span><span style="color: #AE81FF;">)[</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">]</span>
&gt;&gt;&gt; row
<span style="color: #F92672;">int</span>      <span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">0</span>
<span style="color: #F92672;">float</span>    <span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">5</span>
Name: <span style="color: #AE81FF;">0</span>, dtype: float64
&gt;&gt;&gt; <span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span>row<span style="color: #66D9EF;">[</span><span style="color: #E6DB74;">'int'</span><span style="color: #66D9EF;">]</span>.dtype<span style="color: #AE81FF;">)</span>
float64
&gt;&gt;&gt; <span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span>df<span style="color: #66D9EF;">[</span><span style="color: #E6DB74;">'int'</span><span style="color: #66D9EF;">]</span>.dtype<span style="color: #AE81FF;">)</span>
int64
</pre>
</div>

<p>
To preserve dtypes while iterating over the rows, it is better to use itertuples() which returns tuples of the values and which is generally faster as iterrows.
</p>

<ul class="org-ul">
<li>install setup.py:</li>
</ul>
<p>
python setup.py install
</p>
<ul class="org-ul">
<li>magic method:</li>
</ul>
<p>
getitem in a class allows its instances to use the [ ] (indexer) operators
</p>
<ul class="org-ul">
<li>setitem Called to implement assignment to self[key]</li>

<li>call magic method in a class causes its instances to become callables – in other words, those instances now behave like functions.</li>
<li>getattr overrides Python’s default mechanism for member access.</li>
<li>getattr magic method only gets invoked for attributes that are not in the dict magic attribute. Implementing getattr causes the hasattr built-in function to always return True, unless an exception is raised from within getattr.</li>
<li>setattr allows you to override Python’s default mechanism for member assignment.</li>
<li>split strings by space delimiter from reverse:</li>
</ul>

<div class="org-src-container">

<pre class="src src-python">text.rsplit<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">' '</span>, <span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)[</span><span style="color: #AE81FF;">0</span><span style="color: #AE81FF;">]</span>
</pre>
</div>

<ul class="org-ul">
<li>split strings by space delimiter from beginning:</li>
</ul>
<div class="org-src-container">

<pre class="src src-python">text.split<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">' '</span>, <span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)[</span><span style="color: #AE81FF;">0</span><span style="color: #AE81FF;">]</span>
&gt;&gt;&gt;a.split<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'.'</span>,<span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">[</span><span style="color: #E6DB74;">'alvy'</span>,<span style="color: #E6DB74;">'test.txt'</span><span style="color: #AE81FF;">]</span>
&#21518;&#38754;&#22810;&#20102;&#19968;&#20010;&#21442;&#25968;1&#65292;&#20197;&#31532;&#19968;&#20010;<span style="color: #E6DB74;">'.'</span>&#20998;&#30028;&#65292;&#20998;&#25104;&#20004;&#20010;&#23383;&#31526;&#20018;&#65292;&#32452;&#25104;&#19968;&#20010;list
&gt;&gt;&gt;a.rsplit<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'.'</span>,<span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">[</span><span style="color: #E6DB74;">'alvy.test'</span>,<span style="color: #E6DB74;">'txt'</span><span style="color: #AE81FF;">]</span>
&#29616;&#22312;&#26159;rsplit&#20989;&#25968;&#65292;&#20174;&#21491;&#36793;&#31532;&#19968;&#20010;<span style="color: #E6DB74;">'.'</span>&#20998;&#30028;&#65292;&#20998;&#25104;&#20004;&#20010;&#23383;&#31526;&#20018;&#65292;&#32452;&#25104;&#19968;&#20010;list
</pre>
</div>

<ul class="org-ul">
<li>unittest:</li>
</ul>
<p>
check data operation:
create, select, update, delete.
</p>

<ul class="org-ul">
<li>checking parameter types, classes, or values.</li>
<li>checking data structure invariants.</li>
<li>checking “can’t happen” situations (duplicates in a list, contradictory state variables.)</li>
<li>after calling a function, to make sure that its return is reasonable.</li>
</ul>
</div>
</div>
