CS/Python/python.org
* Data Analysis:

** pandas:

- generate a dataframe:
dates = pd.date_range('1/1/2000', periods=8)
df = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=['A', 'B', 'C', 'D'])
- connection with mysql:
pandas.read_sql_query(sql, con=engine):

- pandas.read_sql_table(table_name, con=engine):
- pandas.read_sql(sql, con=engine)

- sql = 'DROP TABLE IF EXISTS etf_daily_price;'
result = engine.execute(sql)
- find all the values of TRUE in a dataframe:
z=(a!=b)
pd.concat([a.ix[z[reduce(lambda x, y: x | z[y], z, False)].index],b.ix[z[reduce(lambda x, y: x | z[y], z, False)].index]],axis=1)
- remove negative value from a column:
1). filtered_1=b[‘TRADE_size’].apply(lambda x: 0 if x < 0 else x)
2). b[‘TRADE_size’].loc[ b[‘TRADE_size’]<0, ‘TRADE_size’] = 0
percentage output format:
from future import division
- print “%s %.4f%%” % (sid, (len(not_close)/len(ctp)))
- rename column names:
df_bbg = df_bbg.rename(columns = lambda x: x[:4].replace(' ',''))

- remove characters after space:
df_bbg = df_bbg.rename(columns = lambda x: x.)
- pandas long format to pivot:
pivoted = df.pivot('name1','name2','name3')

access hierarchical index.

A MultiIndex can be created from a list of arrays (using MultiIndex.from_arrays), an array of tuples (using MultiIndex.from_tuples), or a crossed set of iterables (using MultiIndex.from_product).
#+begin_src python
df.loc[‘date’,’col’], df[‘date’], df.ix[[‘date1’, ‘date2’]]
#+end_src
- slicing:
#+begin_src python
df.loc['start':'end',], df['start': 'end']
#+end_src

- slice with a ‘range’ of values, by providing a slice of tuples:
df.loc[('2006-11-02','USO.US'):('2006-11-06','USO.US')]

    - df.loc(axis=0)[:,['SPY.US']]
    - select certain columns:
df.loc(axis=0)[:,['SPY.US']]['updatedTime']

        - select date range using pd series.
date_not_inserted = whole_index[~whole_index.isin(date_in_database['date'])]
df_need_to_be_updated = whole_df_stack.ix[days_not_in_db]

- remove pandas duplicated index
#+begin_src python

#+end_src

1). grouped = sym.groupby(level=0)
    - sym = grouped.last()

    - 2).df2[~df2.index.duplicated()]
    - set column as datetime index
#+begin_src python

#+end_src

df = df.set_index(pd.DatetimeIndex(df['Date']))
    - change index name:
#+begin_src python

#+end_src

df.index.names = ['Date']
    - for loop in pandas dataframe:
#+begin_src python

#+end_src

for index, value in DataFrame:
    - compare two time series:
#+begin_src python

#+end_src

s1[s1.isin(s2)]
ax = df1.plot()
df2.plot(ax=ax)

- datetime to string:
#+begin_src python

#+end_src

df.index.strftime("%Y-%m-%d %H:%M:%S")
- concaterate index
#+begin_src python

#+end_src

pd.concat([df1, df2], axis=1)
- change the time or date or a datetime:
end = end.replace(hour=23, minute=59, second=59)

- 万德 wind python pandas
#+begin_src python
df = pd.Dataframe(data = w.wsd().Data[0], index=w.wsd().Times)
#+end_src
- concaterate:
pd.concat([df1, df2], axis=0).sort_index()
pd.concat([df1, df2], axis=1)
result = df1.join(df2, how='outer’)

- python解释器CPython.

- 如果字符串里面有’\’,而实际上要把斜杠加到字符串里面，要在前面加r，代表raw. 例如r’Y:\codes’.
- count nan:
np.count_nonzero(~np.isnan(df['series']))

- 如果主目录下有子目录packages，记得要在子目录下加init.py，最好在主目录下建main.py函数。

- 解释器如果执行哪个一个文件为主程序，如 python program1.py，it will set the special variable name to program1.py equals to ‘main’
- One of the reasons for doing this is that sometimes you write a module (a .py file) where it can be executed directly. Alternatively, it can also be imported and used in another module. By doing the main check, you can have that code only execute when you want to run the module as a program and not have it execute when someone just wants to import your module and call your functions themselves.

** plot:

pandas plot.

using matplotlib:
- import matplotlib.pyplot as plt
#+begin_src python
fig = plt.figure()
ax1 = fig.add_subplot(2, 2, 1)
ax2 = fig.add_subplot(2, 2, 2)
ax3 = fig.add_subplot(2, 2, 3)
fig, axes = plt.subplots(2,3)
fig, ax : tuple
#+end_src

- highlight a certain value in the plot:
#+begin_src python
a['DGAZ.US'].hist(bins=50)
plt.axvline(a['DGAZ.US'][-1], color='b', linestyle='dashed', linewidth=2)
#+end_src

fig is the :class:matplotlib.figure.Figure object.

- ax can be either a single axis object or an array of axis
- objects if more than one subplot was created.

[http://docs.pythontab.com/interpy/args_kwargs/Usage_args/]

[http://python.usyiyi.cn/python_278/library/index.html]

[https://docs.python.org/2/reference/simple_stmts.html?highlight=assert]
