docs/CS/Python/python.html

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">2</span> Data Analysis:</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">2.1</span> pandas:</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>generate a dataframe:</li>
</ul>
<p>
dates = pd.date<sub>range</sub>('1/1/2000', periods=8)
df = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=['A', 'B', 'C', 'D'])
</p>
<ul class="org-ul">
<li>connection with mysql:</li>
</ul>
<p>
pandas.read<sub>sql</sub><sub>query</sub>(sql, con=engine):
</p>

<ul class="org-ul">
<li>pandas.read<sub>sql</sub><sub>table</sub>(table<sub>name</sub>, con=engine):</li>
<li>pandas.read<sub>sql</sub>(sql, con=engine)</li>

<li>sql = 'DROP TABLE IF EXISTS etf<sub>daily</sub><sub>price</sub>;'</li>
</ul>
<p>
result = engine.execute(sql)
</p>
<ul class="org-ul">
<li>find all the values of TRUE in a dataframe:</li>
</ul>
<p>
z=(a!=b)
pd.concat([a.ix[z[reduce(lambda x, y: x | z[y], z, False)].index],b.ix[z[reduce(lambda x, y: x | z[y], z, False)].index]],axis=1)
</p>
<ul class="org-ul">
<li>remove negative value from a column:</li>
</ul>
<p>
1). filtered<sub>1</sub>=b[‘TRADE<sub>size</sub>’].apply(lambda x: 0 if x &lt; 0 else x)
2). b[‘TRADE<sub>size</sub>’].loc[ b[‘TRADE<sub>size</sub>’]&lt;0, ‘TRADE<sub>size</sub>’] = 0
percentage output format:
from future import division
</p>
<ul class="org-ul">
<li>print “%s %.4f%%” % (sid, (len(not<sub>close</sub>)/len(ctp)))</li>
<li>rename column names:</li>
</ul>
<p>
df<sub>bbg</sub> = df<sub>bbg.rename</sub>(columns = lambda x: x[:4].replace(' ',''))
</p>

<ul class="org-ul">
<li>remove characters after space:</li>
</ul>
<p>
df<sub>bbg</sub> = df<sub>bbg.rename</sub>(columns = lambda x: x.)
</p>
<ul class="org-ul">
<li>pandas long format to pivot:</li>
</ul>
<p>
pivoted = df.pivot('name1','name2','name3')
</p>

<p>
access hierarchical index.
</p>

<p>
A MultiIndex can be created from a list of arrays (using MultiIndex.from<sub>arrays</sub>), an array of tuples (using MultiIndex.from<sub>tuples</sub>), or a crossed set of iterables (using MultiIndex.from<sub>product</sub>).
</p>
<div class="org-src-container">

<pre class="src src-python">df.loc<span style="color: #AE81FF;">[</span>&#8216;date&#8217;,&#8217;col&#8217;<span style="color: #AE81FF;">]</span>, df<span style="color: #AE81FF;">[</span>&#8216;date&#8217;<span style="color: #AE81FF;">]</span>, df.ix<span style="color: #AE81FF;">[</span><span style="color: #66D9EF;">[</span>&#8216;date1&#8217;, &#8216;date2&#8217;<span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">]</span>
</pre>
</div>
<ul class="org-ul">
<li>slicing:</li>
</ul>
<div class="org-src-container">

<pre class="src src-python">df.loc<span style="color: #AE81FF;">[</span><span style="color: #E6DB74;">'start'</span>:<span style="color: #E6DB74;">'end'</span>,<span style="color: #AE81FF;">]</span>, df<span style="color: #AE81FF;">[</span><span style="color: #E6DB74;">'start'</span>: <span style="color: #E6DB74;">'end'</span><span style="color: #AE81FF;">]</span>
</pre>
</div>

<ul class="org-ul">
<li>slice with a ‘range’ of values, by providing a slice of tuples:</li>
</ul>
<p>
df.loc[('2006-11-02','USO.US'):('2006-11-06','USO.US')]
</p>

<ul class="org-ul">
<li>df.loc(axis=0)[:,['SPY.US']]</li>
<li>select certain columns:</li>
</ul>
<p>
df.loc(axis=0)[:,['SPY.US']]['updatedTime']
</p>

<ul class="org-ul">
<li>select date range using pd series.</li>
</ul>
<p>
date<sub>not</sub><sub>inserted</sub> = whole<sub>index</sub>[~whole<sub>index.isin</sub>(date<sub>in</sub><sub>database</sub>['date'])]
df<sub>need</sub><sub>to</sub><sub>be</sub><sub>updated</sub> = whole<sub>df</sub><sub>stack.ix</sub>[days<sub>not</sub><sub>in</sub><sub>db</sub>]
</p>

<ul class="org-ul">
<li>remove pandas duplicated index</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"></pre>
</div>

<p>
1). grouped = sym.groupby(level=0)
</p>
<ul class="org-ul">
<li>sym = grouped.last()</li>

<li>2).df2[~df2.index.duplicated()]</li>
<li>set column as datetime index</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"></pre>
</div>

<p>
df = df.set<sub>index</sub>(pd.DatetimeIndex(df['Date']))
</p>
<ul class="org-ul">
<li>change index name:</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"></pre>
</div>

<p>
df.index.names = ['Date']
</p>
<ul class="org-ul">
<li>for loop in pandas dataframe:</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"></pre>
</div>

<p>
for index, value in DataFrame:
</p>
<ul class="org-ul">
<li>compare two time series:</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"></pre>
</div>

<p>
s1[s1.isin(s2)]
ax = df1.plot()
df2.plot(ax=ax)
</p>

<ul class="org-ul">
<li>datetime to string:</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"></pre>
</div>

<p>
df.index.strftime("%Y-%m-%d %H:%M:%S")
</p>
<ul class="org-ul">
<li>concaterate index</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"></pre>
</div>

<p>
pd.concat([df1, df2], axis=1)
</p>
<ul class="org-ul">
<li>change the time or date or a datetime:</li>
</ul>
<p>
end = end.replace(hour=23, minute=59, second=59)
</p>

<ul class="org-ul">
<li>万德 wind python pandas</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #FD971F;">df</span> = pd.Dataframe<span style="color: #AE81FF;">(</span>data = w.wsd<span style="color: #66D9EF;">()</span>.Data<span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">0</span><span style="color: #66D9EF;">]</span>, index=w.wsd<span style="color: #66D9EF;">()</span>.Times<span style="color: #AE81FF;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>concaterate:</li>
</ul>
<p>
pd.concat([df1, df2], axis=0).sort<sub>index</sub>()
pd.concat([df1, df2], axis=1)
result = df1.join(df2, how='outer’)
</p>

<ul class="org-ul">
<li>python解释器CPython.</li>

<li>如果字符串里面有’\’,而实际上要把斜杠加到字符串里面，要在前面加r，代表raw. 例如r’Y:\codes’.</li>
<li>count nan:</li>
</ul>
<p>
np.count<sub>nonzero</sub>(~np.isnan(df['series']))
</p>

<ul class="org-ul">
<li>如果主目录下有子目录packages，记得要在子目录下加init.py，最好在主目录下建main.py函数。</li>

<li>解释器如果执行哪个一个文件为主程序，如 python program1.py，it will set the special variable name to program1.py equals to ‘main’</li>
<li>One of the reasons for doing this is that sometimes you write a module (a .py file) where it can be executed directly. Alternatively, it can also be imported and used in another module. By doing the main check, you can have that code only execute when you want to run the module as a program and not have it execute when someone just wants to import your module and call your functions themselves.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">2.2</span> plot:</h3>
<div class="outline-text-3" id="text-2-2">
<p>
pandas plot.
</p>

<p>
using matplotlib:
</p>
<ul class="org-ul">
<li>import matplotlib.pyplot as plt</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #FD971F;">fig</span> = plt.figure<span style="color: #AE81FF;">()</span>
<span style="color: #FD971F;">ax1</span> = fig.add_subplot<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">2</span>, <span style="color: #AE81FF;">2</span>, <span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">ax2</span> = fig.add_subplot<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">2</span>, <span style="color: #AE81FF;">2</span>, <span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">ax3</span> = fig.add_subplot<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">2</span>, <span style="color: #AE81FF;">2</span>, <span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">fig</span>, <span style="color: #FD971F;">axes</span> = plt.subplots<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">2</span>,<span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span>
fig, ax : <span style="color: #F92672;">tuple</span>
</pre>
</div>

<ul class="org-ul">
<li>highlight a certain value in the plot:</li>
</ul>
<div class="org-src-container">

<pre class="src src-python">a<span style="color: #AE81FF;">[</span><span style="color: #E6DB74;">'DGAZ.US'</span><span style="color: #AE81FF;">]</span>.hist<span style="color: #AE81FF;">(</span>bins=<span style="color: #AE81FF;">50</span><span style="color: #AE81FF;">)</span>
plt.axvline<span style="color: #AE81FF;">(</span>a<span style="color: #66D9EF;">[</span><span style="color: #E6DB74;">'DGAZ.US'</span><span style="color: #66D9EF;">][</span>-<span style="color: #AE81FF;">1</span><span style="color: #66D9EF;">]</span>, color=<span style="color: #E6DB74;">'b'</span>, linestyle=<span style="color: #E6DB74;">'dashed'</span>, linewidth=<span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
fig is the :class:matplotlib.figure.Figure object.
</p>

<ul class="org-ul">
<li>ax can be either a single axis object or an array of axis</li>
<li>objects if more than one subplot was created.</li>
</ul>

<p>
[<a href="http://docs.pythontab.com/interpy/args_kwargs/Usage_args/">http://docs.pythontab.com/interpy/args_kwargs/Usage_args/</a>]
</p>

<p>
[<a href="http://python.usyiyi.cn/python_278/library/index.html">http://python.usyiyi.cn/python_278/library/index.html</a>]
</p>

<p>
[<a href="https://docs.python.org/2/reference/simple_stmts.html?highlight=assert">https://docs.python.org/2/reference/simple_stmts.html?highlight=assert</a>]
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-04-22 Sat&gt;</span></span></p>
<p class="author">Author: weiwu</p>
<p class="date">Created: 2017-04-22 Sat 15:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
